nxp-appcodehub/dm-lpc860-smart-lighting/board/pin_mux.h
/*
* Copyright 2023 NXP
* All rights reserved.
*
* SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDbgUARTPins(void); /* Function assigned for the Cortex-M0P */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSYSPins(void); /* Function assigned for the Cortex-M0P */

/*! @name PIO1_1 (number 18), LED_B_P
  @{ */
#define BOARD_INITLEDPINS_LED_B_P_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_LED_B_P_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_LED_B_P_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_2 (number 20), LED_B_N
  @{ */
#define BOARD_INITLEDPINS_LED_B_N_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_LED_B_N_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_LED_B_N_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_3 (number 29), LED_R_P
  @{ */
#define BOARD_INITLEDPINS_LED_R_P_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_LED_R_P_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_LED_R_P_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_4 (number 31), LED_R_N
  @{ */
#define BOARD_INITLEDPINS_LED_R_N_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_LED_R_N_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_LED_R_N_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_5 (number 35), LED_G_P
  @{ */
#define BOARD_INITLEDPINS_LED_G_P_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_LED_G_P_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_LED_G_P_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_6 (number 38), LED_G_N
  @{ */
#define BOARD_INITLEDPINS_LED_G_N_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_LED_G_N_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_LED_G_N_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDPins(void); /* Function assigned for the Cortex-M0P */

#define IOCON_PIO_CLKDIV0 0x00u      /*!<@brief IOCONCLKDIV0 */
#define IOCON_PIO_HYS_EN 0x20u       /*!<@brief Enable hysteresis */
#define IOCON_PIO_INV_DI 0x00u       /*!<@brief Input not invert */
#define IOCON_PIO_MODE_INACT 0x00u   /*!<@brief No addition pin function */
#define IOCON_PIO_OD_DI 0x00u        /*!<@brief Disables Open-drain function */
#define IOCON_PIO_SMODE_BYPASS 0x00u /*!<@brief Bypass input filter */

/*! @name PIO1_1 (number 18), LED_B_P
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDPINS_DEINIT_LED_B_P_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDPINS_DEINIT_LED_B_P_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDPINS_DEINIT_LED_B_P_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_DEINIT_LED_B_P_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_DEINIT_LED_B_P_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_2 (number 20), LED_B_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDPINS_DEINIT_LED_B_N_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDPINS_DEINIT_LED_B_N_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDPINS_DEINIT_LED_B_N_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_DEINIT_LED_B_N_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_DEINIT_LED_B_N_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_3 (number 29), LED_R_P
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDPINS_DEINIT_LED_R_P_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDPINS_DEINIT_LED_R_P_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDPINS_DEINIT_LED_R_P_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_DEINIT_LED_R_P_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_DEINIT_LED_R_P_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

