nxp-appcodehub/dm-lpc860-smart-lighting/board/pin_mux.h
/*! @name PIO1_4 (number 31), LED_R_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDPINS_DEINIT_LED_R_N_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDPINS_DEINIT_LED_R_N_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDPINS_DEINIT_LED_R_N_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_DEINIT_LED_R_N_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_DEINIT_LED_R_N_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_5 (number 35), LED_G_P
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDPINS_DEINIT_LED_G_P_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDPINS_DEINIT_LED_G_P_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDPINS_DEINIT_LED_G_P_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_DEINIT_LED_G_P_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_DEINIT_LED_G_P_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_6 (number 38), LED_G_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDPINS_DEINIT_LED_G_N_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDPINS_DEINIT_LED_G_N_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITLEDPINS_DEINIT_LED_G_N_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITLEDPINS_DEINIT_LED_G_N_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDPINS_DEINIT_LED_G_N_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitLEDPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitLEDPins_deinit(void); /* Function assigned for the Cortex-M0P */

/*! @name ADC_9 (number 63), ADC_NTC
  @{ */
#define BOARD_INITADCPINS_ADC_NTC_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_ADC_NTC_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_ADC_NTC_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name ADC_2 (number 49), ADC_LED_R
  @{ */
#define BOARD_INITADCPINS_ADC_LED_R_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_ADC_LED_R_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_ADC_LED_R_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name ADC_1 (number 46), ADC_LED_G
  @{ */
#define BOARD_INITADCPINS_ADC_LED_G_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_ADC_LED_G_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_ADC_LED_G_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name ADC_3 (number 51), ADC_LED_B
  @{ */
#define BOARD_INITADCPINS_ADC_LED_B_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_ADC_LED_B_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_ADC_LED_B_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name ADC_10 (number 2), ADC_POT
  @{ */
#define BOARD_INITADCPINS_ADC_POT_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_ADC_POT_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_ADC_POT_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name ADC_8 (number 61), ADC_ALS
  @{ */
#define BOARD_INITADCPINS_ADC_ALS_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_ADC_ALS_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_ADC_ALS_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADCPins(void); /* Function assigned for the Cortex-M0P */

#define IOCON_PIO_CLKDIV0 0x00u      /*!<@brief IOCONCLKDIV0 */
#define IOCON_PIO_HYS_EN 0x20u       /*!<@brief Enable hysteresis */
#define IOCON_PIO_INV_DI 0x00u       /*!<@brief Input not invert */
#define IOCON_PIO_MODE_INACT 0x00u   /*!<@brief No addition pin function */
#define IOCON_PIO_OD_DI 0x00u        /*!<@brief Disables Open-drain function */
#define IOCON_PIO_SMODE_BYPASS 0x00u /*!<@brief Bypass input filter */

/*! @name PIO0_17 (number 63), ADC_NTC
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITADCPINS_DEINIT_ADC_NTC_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITADCPINS_DEINIT_ADC_NTC_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITADCPINS_DEINIT_ADC_NTC_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_DEINIT_ADC_NTC_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_DEINIT_ADC_NTC_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_14 (number 49), ADC_LED_R
  @{ */

