nxp-appcodehub/dm-lpc860-smart-lighting/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_R_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_R_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_R_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_R_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_R_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO0_6 (number 46), ADC_LED_G
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_G_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_G_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_G_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_G_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_G_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO0_23 (number 51), ADC_LED_B
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_B_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_B_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_B_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_B_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_DEINIT_ADC_LED_B_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO0_13 (number 2), ADC_POT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITADCPINS_DEINIT_ADC_POT_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITADCPINS_DEINIT_ADC_POT_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITADCPINS_DEINIT_ADC_POT_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITADCPINS_DEINIT_ADC_POT_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_DEINIT_ADC_POT_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitADCPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitADCPins_deinit(void); /* Function assigned for the Cortex-M0P */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void); /* Function assigned for the Cortex-M0P */

/*! @name PIO0_19 (number 60), DBG0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDBGPINS_DBG0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDBGPINS_DBG0_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITDBGPINS_DBG0_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITDBGPINS_DBG0_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITDBGPINS_DBG0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_20 (number 58), DBG1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDBGPINS_DBG1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDBGPINS_DBG1_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITDBGPINS_DBG1_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITDBGPINS_DBG1_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITDBGPINS_DBG1_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_21 (number 57), DBG2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDBGPINS_DBG2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDBGPINS_DBG2_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_INITDBGPINS_DBG2_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITDBGPINS_DBG2_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITDBGPINS_DBG2_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDbgPins(void); /* Function assigned for the Cortex-M0P */

/*! @name PIO0_16 (number 19), RX
  @{ */
#define BOARD_INITDALIPINS_RX_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITDALIPINS_RX_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITDALIPINS_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_15 (number 30), TX
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDALIPINS_TX_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDALIPINS_TX_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITDALIPINS_TX_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITDALIPINS_TX_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITDALIPINS_TX_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDALIPins(void); /* Function assigned for the Cortex-M0P */

/*! @name PIO0_4 (number 6), BTN_USR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBTNPINS_BTN_USR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBTNPINS_BTN_USR_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITBTNPINS_BTN_USR_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITBTNPINS_BTN_USR_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITBTNPINS_BTN_USR_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBTNPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
